Revit 2027 API
FilterIntegerRule.RuleValue Property
 The user-supplied value against which values from a Revit document will be tested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int RuleValue { get; set; }
Public Property RuleValue As Integer
	Get
	Set
public:
property int RuleValue {
	int get ();
	void set (int value);
}
member RuleValue : int with get, set
Property Value
Int32
See Also
Reference
FilterIntegerRule Class
Autodesk.Revit.DB Namespace